In [1]:
import pandas as pd

In [30]:
cp_data = "Project_2/city_pop.csv"
ll_data = "Project_2/lat_long.csv"

In [31]:
cp_df = pd.read_csv(cp_data)
cp_df.head()

  STATE_NAME        CITY POP_EST_19
0    Alabama  Birmingham    209,403
1    Alabama  Huntsville    200,574
2    Alabama      Mobile    188,720
3    Alabama  Montgomery    198,525
4    Alabama  Tuscaloosa    101,129

In [32]:
ll_df = pd.read_csv(ll_data)
ll_df.head()

  STATE_CODE STATE_NAME        CITY   LATITUDE  LONGITUDE
0         AL    Alabama   Abbeville  31.575479 -85.279044
1         AL    Alabama    Abernant  33.290278 -87.198056
2         AL    Alabama  Adamsville  33.588437 -86.959727
3         AL    Alabama     Addison  34.205571 -87.194766
4         AL    Alabama       Adger  33.434277 -87.167455

In [33]:
len(cp_df)

155

In [34]:
city_df = pd.merge(cp_df, ll_df, on=['STATE_NAME', 'CITY'])

In [35]:
city_df.head()

  STATE_NAME        CITY POP_EST_19 STATE_CODE   LATITUDE  LONGITUDE
0    Alabama  Birmingham    209,403         AL  33.519000 -86.801400
1    Alabama  Birmingham    209,403         AL  33.401559 -86.705511
2    Alabama  Huntsville    200,574         AL  34.726866 -86.567318
3    Alabama      Mobile    188,720         AL  30.695900 -88.043400
4    Alabama  Montgomery    198,525         AL  32.374300 -86.311800

In [36]:
len(city_df)

203

In [37]:
city_nodup = city_df.drop_duplicates(subset=["STATE_NAME", "CITY"])
city_nodup.head()

  STATE_NAME        CITY POP_EST_19 STATE_CODE   LATITUDE  LONGITUDE
0    Alabama  Birmingham    209,403         AL  33.519000 -86.801400
2    Alabama  Huntsville    200,574         AL  34.726866 -86.567318
3    Alabama      Mobile    188,720         AL  30.695900 -88.043400
4    Alabama  Montgomery    198,525         AL  32.374300 -86.311800
5    Alabama  Tuscaloosa    101,129         AL  33.196891 -87.562666

In [38]:
len(city_nodup)

155

In [39]:
output_file = "Project_2/city_list.csv"

In [40]:
city_nodup.to_csv(output_file, index=False, header=True)